In [7]:
read_csv = pd.read_csv('titanic_raw_data.csv')
print(read_csv.head())

                PassengerId;Survived;Pclass;Name;Sex;Age;SibSp;Parch;Ticket;Fare;Cabin;Embarked
1;0;3;Braund       Mr. Owen Harris;male;22.0;1;0;A/5 21171;7.25;;S
2;1;1;Cumings     Mrs. John Bradley (Florence Briggs Thayer);fe...
3;1;3;Heikkinen   Miss. Laina;female;26.0;0;0;STON/O2. 3101282;...
4;1;1;Futrelle    Mrs. Jacques Heath (Lily May Peel);female;35....
5;0;3;Allen         Mr. William Henry;male;35.0;0;0;373450;8.05;;S

In [8]:
lst1 = [1,2.5, "hello"]
series = pd.Series(lst1)
series

0        1
1      2.5
2    hello
dtype: object

In [10]:
# creating series form list

data = [10, 20, 30, 40, 50]
s = pd.Series(data,index=['maths', 'sci', 'ss', 'bio', 'math'])
s

tuple1 = (100, 200, 300, 400)
series2 = pd.Series(tuple1)
tuple1

maths    10
sci      20
ss       30
bio      40
math     50
dtype: int64

In [15]:
# dataframe using dictionary

data = {'Name': ['John', 'Anna', 'Peter', 'Linda'],
        'Age': [28, 24, 35, 32],
        'City': ['New York', 'Paris', 'Berlin', 'London']
        }

df = pd.DataFrame(data)
df
df.index

RangeIndex(start=0, stop=4, step=1)

In [18]:
# renaming a column
df.rename(columns={'Name': 'Bacche'}, inplace=True)
print(df)

  Bacche  Age      City
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [19]:
import pandas as pd

In [25]:
read_csv = pd.read_csv('titanic_raw_data.csv', sep=";")
#print(read_csv.head())
read_csv

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
895,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
896,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
897,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
898,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
899,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [27]:
read_csv.info() # gives summary of dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 900 entries, 0 to 899
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  900 non-null    int64
 1   Survived     900 non-null    int64
 2   Pclass       900 non-null    int64
 3   Name         900 non-null    object
 4   Sex          900 non-null    object
 5   Age          723 non-null    float64
 6   SibSp        900 non-null    int64
 7   Parch        900 non-null    int64
 8   Ticket       900 non-null    object
 9   Fare         900 non-null    float64
 10  Cabin        207 non-null    object
 11  Embarked     898 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 84.5+ KB

In [29]:
read_csv.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,900.000000,900.000000,900.000000,723.000000,900.000000,900.000000,900.000000
mean,450.417778,0.384444,2.308889,29.673817,0.518889,0.384444,32.061342
std,259.812778,0.486734,0.837211,14.474419,1.098426,0.817619,49.476014
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,225.750000,0.000000,2.000000,20.750000,0.000000,0.000000,7.895800
50%,450.500000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,675.250000,1.000000,3.000000,38.000000,1.000000,0.000000,30.771850
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
read_csv.describe(include="O")  # here O stands for object data type

                       Name   Sex    Ticket Cabin Embarked
count                   900   900       900   207      898
unique                  891     2       681   147        3
top     Dooley, Mr. Patrick  male  CA. 2343    G6        S
freq                      5   585         7     4      645

In [35]:
read_csv.columns# renaming columns in a dataframe

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [36]:
read_csv.shape

(900, 12)

In [38]:
read_csv[["Name","Age","Pclass"]]

                                                  Name   Age  Pclass
0                              Braund, Mr. Owen Harris  22.0       3
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0       1
2                               Heikkinen, Miss. Laina  26.0       3
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0       1
4                             Allen, Mr. William Henry  35.0       3
..                                                 ...   ...     ...
895               Rice, Mrs. William (Margaret Norton)  39.0       3
896                    Johnson, Master. Harold Theodor   4.0       3
897                              Behr, Mr. Karl Howell  26.0       1
898                              Behr, Mr. Karl Howell  26.0       1
899                              Behr, Mr. Karl Howell  26.0       1

[900 rows x 3 columns]

In [40]:
read_csv.loc[0] # here loc is used to access a row by its label

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [ ]:
read_csv.iloc[0] # here iloc is used

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [50]:
read_csv.loc[0,'Embarked']

'S'

In [51]:
print(read_csv.loc[0,"Pclass"])

3

In [52]:
read_csv.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [53]:
read_csv.iloc[3,3]

'Futrelle, Mrs. Jacques Heath (Lily May Peel)'

In [61]:
read_csv.loc[0:2,["Name","Age"]]

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0

In [62]:
read_csv.iloc[0:2, :2]

   PassengerId  Survived
0            1         0
1            2         1

In [63]:
# filtering with simple condition 

read_csv[read_csv["Age"]> 30]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
891,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
892,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
893,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
894,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
895,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q